# StationingInterval Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..StationingInterval Property
SpecTypeId Class See Also
---
Stationing Interval, in discipline Infrastructure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId StationingInterval { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StationingInterval As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StationingInterval {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace